Repository: marcosjunqueira/sonar-l10n-pt-omegat
Catalog: tm/html-omegat.tmx
Source language: en_us
Languages: pt_br

source: Creates a new HTML file.
pt_br: Cria um novo arquivo HTML.

source: You can edit the file in the IDE's Source Editor.
pt_br: Você pode editar o arquivo no Editor de Código-fonte da IDE.

source: You can view the file in a web browser by right-clicking the file's node in the Projects window and choosing View.
pt_br: Você pode visualizar o arquivo em um navegador web pelo clique do botão direito em nó de arquivos na janela de Projetos e escolhendo Visualizar.

source: Creates a new XHTML Strict file.
pt_br: Cria um novo arquivo XHTML Explícito.

source: You can validate against the DTD using the context menu.
pt_br: Você pode validar contra o DTD utilizando o menu de contexto.

source: Supports creation, editing, and viewing of HTML files.
pt_br: Suporta criação, edição, e visualização de arquivos HTML.

source: The HTML module supports creation and editing of HTML files and enables you to view them in a web browser.
pt_br: O módulo HTML suporta criação e edição de arquivos HTML e habilita você a visualizá-los em um navegador web.

source: HTML Objects
pt_br: Objetos HTML

source: HTML File
pt_br: Arquivo HTML

source: Encoding
pt_br: Codificação

source: Encoding of the file.
pt_br: Codificação de arquivo.

source: Text
pt_br: Texto

source: Properties of the text file
pt_br: Arquivo texto de prioridades

source: XHTML File
pt_br: Arquivo XHTML

source: HTML and XHTML Files
pt_br: Arquivos HTML e XHTML

source: <html>The encoding {1} specified in meta tag of the document {0} is invalid<br> or the document contains characters which cannot be saved using this encoding.<br> Do you want to save the file using{3} <b>{2}</b> encoding?</html>
pt_br: <html>A codificação {1} especificada na marcação meta do documento {0} é inválida<br> ou o documento contém caracteres que não podem ser salvos utilizando esta codificação<br> Vocês quer salvar o arquivo utilizando{3} <b>{2}</b> codificação?</html>

source: <html>The encoding {1} specified in meta tag of the document {0} is invalid.<br>Do you want to load the file using <b>{2}</b> encoding?</html>
pt_br: <html>A codificação {1} especificada em marcação meta do documento {0} é inválida.<br>Você quer carregar o arquivo utilizando <b>{2}</b> codificação?</html>

source: <html>The {0} contains characters which will probably be damaged during conversion to the {1} character set.<br> Do you want to save the file using <b>UTF-8</b> character set?</html>
pt_br: <html>O {0} contém caractere que provavelmente será danificado durante conversão para o {1} conjunto de caracteres.<br> Você quer salvar o arquivo utilizando <b>UTF-8</b> o conjunto de caracteres?</html>

source: HTML Forms
pt_br: Formulários HTML

source: Select File
pt_br: Selecionar arquivo

source: Cancel
pt_br: Cancelar

source: Browse Files
pt_br: Procurar arquivos

source: Folders:
pt_br: Diretórios:

source: No document selected.
pt_br: Documento não selecionado.

source: Please select a document to insert the item into.
pt_br: Por favor selecionar um documento para inserir em seu interior o item

source: &HTML/JSP Code Clips
pt_br: &Fragmentos de código HTML

source: Insert
pt_br: Inserir

source: &Protocol:
pt_br: &Protocolo:

source: &Text:
pt_br: &Texto:

source: Ta&rget:
pt_br: Des&tino:

source: Br&owse...
pt_br: Pro&curar...

source: Protocol
pt_br: Protocolo

source: Protocol prefix of the constructed URL
pt_br: Prefixo do protocolo do URL construído

source: Target
pt_br: Destino

source: URL which the link is pointing to.
pt_br: URL que o link aponta para.

source: Text visible to a user
pt_br: Texto visível para um usuário

source: Frame name the referenced object is opened in.
pt_br: O nome da moldura do objeto referenciado está aberto em.

source: Browse
pt_br: Procurar

source: Browse local objects.
pt_br: Procurar objetos locais.

source: It returns a relative path from the edited document to the selected object.
pt_br: Retorna um caminho relativo de um documento editado para um objeto selecionado.

source: Same Frame
pt_br: Mesmo quadro

source: New Window
pt_br: Nova janela

source: Parent Frame
pt_br: Quadro pai

source: Full Window
pt_br: Janela total

source: &Label:
pt_br: &Rótulo:

source: Type:
pt_br: Inserir:

source: Initial State:
pt_br: Estado inicial:

source: &Name:
pt_br: &Nome:

source: Label
pt_br: Rótulo

source: Type
pt_br: Inserir

source: Initial State
pt_br: Estado inicial

source: Name
pt_br: Nome

source: Visible button label
pt_br: Rótulo visível do botão

source: Button type
pt_br: Tipo de botão

source: Initial button state (disabled or not)
pt_br: Estado inicial do botão (desabilitado ou não)

source: Button object name
pt_br: Nome do objeto botão

source: Submit button
pt_br: Botão submeter

source: Reset button
pt_br: Botão redefinir

source: Standard button
pt_br: Botão padrão

source: disabled
pt_br: desabilitado

source: Select if the button should be initially disabled.
pt_br: Selecionar se o botão deveria estar inicialmente desabilitado.

source: &disabled
pt_br: &desabilitado

source: &submit
pt_br: &submeter

source: &reset
pt_br: &redefinir

source: s&tandard
pt_br: p&adrão

source: submit
pt_br: submeter

source: reset
pt_br: redefinir

source: standard
pt_br: padrão

source: &Value:
pt_br: &Valor:

source: &selected
pt_br: &selecionado

source: Value
pt_br: Valor

source: selected
pt_br: selecionado

source: Checkbox object name
pt_br: Nome do objeto caixa de verificação

source: Checkbox value representing its selection in the form data set.
pt_br: Valor da caixa de verificação representa esta seleção em forma de conjunto de dados.

source: Initial checkbox state, default value is unselected and enabled.
pt_br: Estado inicial da caixa de verificação, valor padrão não está selecionado e habilitado.

source: Select if the checkbox should be initially disabled.
pt_br: Selecionar se a caixa de verificação deveria estar inicialmente desabilitada.

source: Select if the checkbox should be initially selected.
pt_br: Selecionar se a caixa de verificação deveria estar inicialmente selecionada.

source: Represents the checkbox selection in the form data set.
pt_br: Representa a seleção da caixa de verificação no formulário do conjunto de dados.

source: &Width:
pt_br: &Largura:

source: Width
pt_br: Largura

source: File select object name
pt_br: Nome do objeto selecionador de arquivo

source: File select width
pt_br: Largura do selecionador de arquivos

source: Initial file select state (disabled or not)
pt_br: Estado inicial do arquivo selecionado (desabilitar ou não)

source: Select if the file select should be initially disabled.
pt_br: Selecionar se o arquivo selecionado deveria estar inicialmente desabilitado.

source: &Action:
pt_br: &Ação:

source: Method:
pt_br: Método:

source: Encoding:
pt_br: Codificação:

source: Action
pt_br: Ação

source: Method
pt_br: Método

source: Action performed on a form submission.
pt_br: Executar ação no formulário de submissão.

source: Browse for an action.
pt_br: Procurar por uma ação.

source: Method with which a form is submitted.
pt_br: Método com que um formulário está submetido.

source: GET method
pt_br: Método GET

source: POST method
pt_br: Método POST

source: Encoding type of form data set.
pt_br: Tipo de codificação do conjunto de dados do formulário.

source: application/x-www-form-&urlencoded encoding
pt_br: aplicativo/x-www-formulário-&urlcodificado codificação

source: multipart/form-data encoding
pt_br: Padrão de fonte de eventos de difusão

source: Form object name
pt_br: Nome do objeto de formulário

source: &Location:
pt_br: &Localização:

source: &Height:
pt_br: &Altura:

source: &Alternate Text:
pt_br: &Texto alternativo

source: Location
pt_br: Localização

source: Height
pt_br: Altura

source: Alternate text
pt_br: Texto alternativo

source: Browse button
pt_br: Botão procurar

source: Image location
pt_br: Localização da imagem

source: Image width
pt_br: Largura da imagem

source: Image height
pt_br: Altura da imagem

source: Alternate text when the image cannot be shown.
pt_br: Texto alternativo quando a imagem não pode ser mostrada.

source: Browse the images.
pt_br: Procurar imagens.

source: Image Files
pt_br: Arquivos de imagem

source: Initial &Value:
pt_br: Valor &Inicial:

source: &text
pt_br: &texto

source: &password
pt_br: &senha

source: &hidden
pt_br: &oculto

source: &readonly
pt_br: &somente leitura

source: Initial Value
pt_br: Valor inicial

source: text
pt_br: texto

source: password
pt_br: senha

source: hidden
pt_br: oculto

source: readonly
pt_br: somente leitura

source: Input object name
pt_br: Nome do objeto de entrada

source: Initial input value
pt_br: Valor inicial da entrada

source: Input type (text or password or hidden)
pt_br: Tipo de entrada (texto ou senha ou oculto)

source: Text input
pt_br: Entrada de texto

source: Password input
pt_br: Entrada de senha

source: Hidden input
pt_br: Entrada oculta

source: Initial input state (disabled, readonly)
pt_br: Estado da entrada inicial (desabilitar, somente leitura)

source: Disabled input
pt_br: Entrada desabilitada

source: Readonly input
pt_br: Entrada somente leitura

source: Input width
pt_br: Largura da entrada

source: HTTP &Header
pt_br: &Cabeçalho HTTP

source: Search &Engines
pt_br: &Mecanismos de busca

source: &Content:
pt_br: &Conteúdo:

source: HTTP header
pt_br: Cabeçalho HTTP

source: Search engines
pt_br: Mecanismos de busca

source: Content
pt_br: Conteúdo

source: Type of generated meta tag
pt_br: Tipo de meta marcação gerada

source: http header information
pt_br: informação de cabeçalho http

source: information for the search engines
pt_br: Informação para os mecanismos de busca

source: information name
pt_br: nome da informação

source: information content
pt_br: conteúdo da informação

source: &Number of Items:
pt_br: &Número de itens:

source: Numbering Style:
pt_br: Estilo de numeração:

source: default
pt_br: padrão

source: Number of items
pt_br: Número de itens

source: Numbering style
pt_br: Estilo de numeração

source: arabic numbers
pt_br: números arábicos

source: Lower alpha
pt_br: Alfa minúsculo

source: Upper alpha
pt_br: Alfa maiúsculo

source: Lower roman
pt_br: Romano minúsculo

source: Upper roman
pt_br: Romano maiúsculo

source: Number of items in the list
pt_br: Número de itens na lista

source: Numbering style of items
pt_br: Estilo de numeração dos itens

source: Numbering default to the level of nesting
pt_br: Numeração padrão para o nível de alinhamento

source: Arabic numbers
pt_br: Números arábicos

source: &Group:
pt_br: &Grupo:

source: Group
pt_br: Grupo

source: Radio group to insert this radio into.
pt_br: Inserir esta opção em grupo de opções.

source: Value representing the selected radio button in the sent form data set.
pt_br: O valor representando o botão de opção selecionado enviado em formulário do conjunto de dados.

source: Initial state (selected, disabled)
pt_br: Estado inicial (selecionado, desabilitado)

source: Radio button initially selected.
pt_br: Botão de opção inicialmente selecionado.

source: Radio button initially disabled.
pt_br: Botão de opção inicialmente desabilitado.

source: &Options:
pt_br: &Opções:

source: &Visible Options:
pt_br: &Opções visíveis:

source: Multiple Selections:
pt_br: Seleções múltiplas:

source: &allowed
pt_br: &permitido

source: Options
pt_br: Opções

source: Visible options
pt_br: Opções visíveis

source: Multiple selections
pt_br: Seleções múltiplas

source: allowed
pt_br: permitido

source: Initial state
pt_br: Estado inicial

source: Select object name
pt_br: Selecionar nome do objeto

source: Number of options
pt_br: Número de opções

source: Number of visible options
pt_br: Número de opções visíveis

source: Allows more than one option to be selected
pt_br: Permitir que mais de uma opção seja selecionada

source: When selected, more than one option can be selected
pt_br: Quando selecionado, mais de uma opção pode ser selecionada

source: When selected then initial state is disabled
pt_br: Quando selecionado o estado inicial é desabilitado

source: &Columns:
pt_br: &Colunas:

source: &Border Size:
pt_br: &Tamanho da borda:

source: Cell &Spacing:
pt_br: &Espaceamento de células:

source: Cell &Padding:
pt_br: &Preenchimento de células:

source: Columns
pt_br: Colunas

source: Border size
pt_br: Tamanho da borda

source: Cell spacing
pt_br: Espaceamento de células

source: Cell padding
pt_br: Preenchimento de células

source: The amount of space between the cells.
pt_br: O montante de espaço entre as células.

source: The amount of space between the border of the cell and its content.
pt_br: O montante de espaço entre a borda da célula e o seu conteúdo.

source: Table object name
pt_br: Nome do objeto da tabela

source: Number of columns
pt_br: Número de colunas

source: &Rows:
pt_br: &Linhas:

source: Rows
pt_br: Linhas

source: Number of rows
pt_br: Número de linhas

source: Border width
pt_br: Largura da borda

source: Table width
pt_br: Largura da tabela

source: r&ead-only
pt_br: s&omente leitura

source: Initial value
pt_br: Valor inicial

source: Textarea object name
pt_br: Nome do objeto da área de texto

source: Initial state (disabled, readonly)
pt_br: Estado inicial (desabilitado, somente leitura)

source: When selected, textarea is initially disabled.
pt_br: Quando selecionada, a área de texto está inicialmente desabilitada.

source: When selected, textarea is initially readonly.
pt_br: Quando selecionada, a área de texto é inicialmente somente para leitura.

source: disc
pt_br: disco

source: circle
pt_br: círculo

source: square
pt_br: quadrado

source: Table
pt_br: Tabela

source: Ordered List
pt_br: Lista ordenada

source: Unordered List
pt_br: Lista desordenada

source: Image
pt_br: Imagem

source: Meta data
pt_br: Metadados

source: Form
pt_br: Formulário

source: Text Input
pt_br: Entrada de texto

source: Multi-line Input
pt_br: Entrada multi-linha

source: Drop-down List
pt_br: Lista suspensa

source: <html>&lt;select name=""&gt;<br>&nbsp;&nbsp;&lt;option&gt;<br>&nbsp;&nbsp;&lt;/option&gt;<br>&lt;/select&gt;</html>
pt_br: <html>&lt;selecionar nome=""&gt;<br>&nbsp;&nbsp;&lt;option&gt;<br>&nbsp;&nbsp;&lt;/option&gt;<br>&lt;/select&gt;</html>

source: Checkbox
pt_br: Caixa de seleção

source: Radio Button
pt_br: Botão de opção

source: File Select
pt_br: Selecionar arquivo

source: Button
pt_br: Botão

source: Line Wrapping Indentation Engine
pt_br: Motor de indentação com quebra de linhas

source: Indentation engine that automatically breaks lines after passing the text limit marker.
pt_br: Mecanismo de indentação que automaticamente quebra linhas depois de passar o limite do marcador de texto

source: HTML Indentation Engine
pt_br: Mecanismo de indentação HTML

source: Indentation engine for HTML files.
pt_br: Mecanismo de indentação para arquivos HTML.

source: Expand All &Comments
pt_br: Expandir todos os &comentários

source: Collapse All C&omments
pt_br: Ocultar todos os c&omentários

source: Expand All Comments
pt_br: Expandir todos os comentários

source: Collapse All Comments
pt_br: Ocultar todos os comentários

source: HTML Editor
pt_br: Editor de HTML

source: Editing
pt_br: Editando

source: Contains HTML editor implementation
pt_br: Contém implementação do editor de HTML

source: HTML Editor contains editing support for HTML files
pt_br: Editor HTML contém suporte para edição de arquivos HTML

source: Tag
pt_br: Marcação

source: Parameter Value
pt_br: Valor do parâmetro

source: Error
pt_br: Erro

source: Character
pt_br: Caractere

source: SGML Comment
pt_br: Comentário SGML

source: Argument
pt_br: Argumento

source: SGML Declaration
pt_br: Declaração SGML

source: Operator
pt_br: Operador

source: Block Comment
pt_br: Comentário em bloco

source: Css Embedded in HTML
pt_br: Css embutido em HTML

source: Javascript Embedded in HTML
pt_br: Javascript embutido em HTML

source: Unsupported tag
pt_br: Marcação não suportada

source: Unfinished tag
pt_br: Marcação não terminada

source: Unpaired end tag
pt_br: Fim da marcação sem paridade

source: Unexpected character
pt_br: Caractere inesperado

source: Deprecated tag
pt_br: Marcação obsoleta

source: Deprecated attribute
pt_br: Atributo obsoleto

source: Expand HTML Tag
pt_br: Expandir marcação HTML

source: Collapse HTML Tag
pt_br: Ocultar marcação HTML

source: Expand HTML Comment
pt_br: Expandir comentário HTML

source: Collapse HTML Comment
pt_br: Ocultar comentário HTML

source: Case Sensitive Code Completion
pt_br: Auto-completar de código com distinção de maiúsculas/minúsculas

source: If True, the completion query search will be case sensitive
pt_br: Se verdadeiro, auto-completar da consulta pesquisará com distinção de maiúsculas/minúsculas

source: Code Completion Natural Sort
pt_br: Ordenação natural do auto-completar de código

source: If True, the completion search results will be sorted naturally
pt_br: Se verdadeiro, auto-completar dos resultados da pesquisa serão ordenados naturalmente

source: Code Completion Instant Substitution
pt_br: Substituição instantânea do auto-completar de código

source: If True, invocation of code completion perform instant substitution, if the search result contains only one item
pt_br: Se verdadeiro, a invocação do auto-completar de código desempenha substituição instantânea, se o resultado da pesquisa contém só um item

source: Code Completion Lowercase Substitution
pt_br: Substituição do auto-completar de código em letras minúsculas

source: If True, HTML Code Completion will be available in lower case.
pt_br: Se verdadeiro, o auto-completar código será disponibilizado em letras minúsculas.

source: Code Folding Update Interval
pt_br: Intervalo de atualização do dobramento de código

source: How long to wait (in milliseconds) when document content is changed before refreshing code folds.
pt_br: Aguardar (em milisegundos) enquanto o conteúdo do documento é modificado antes da atualização dos dobramentos de código.

source: Code Folding Enabled
pt_br: Dobramento de código habilitado

source: If enabled, code folds are created.
pt_br: Se habilitado, dobramentos de código são criados.

source: HTML Editor Library
pt_br: Biblioteca do editor de HTML

source: Contains HTML editor library implementation
pt_br: Contém implementação da biblioteca do editor de HTML

source: HTML Editor Library contains editing support for HTML files that can be used in standalone editor
pt_br: Biblioteca do editor de HTML contém suporte de edição para arquivos HTML que pode ser utilizada em editor independente

source: Go to previous page
pt_br: Ir para a página anterior

source: Go to next page
pt_br: Ir para a próxima página

source: Show javadoc in external web browser
pt_br: Exibir javadoc em navegador navegador externo

source: Open source in editor
pt_br: Código-fonte no editor

source: Reformatting code
pt_br: Reformatando código

source: HTML Lexer
pt_br: Analizador léxico HTML

source: Lexical analysis for html language
pt_br: Análise léxica para a linguagem html

source: Contains html language lexical tokens definition plus the lexer that recognizes the html language.
pt_br: Contém definição léxica dos símbolos da linguagem html mais o analizador léxico que reconhece a linguagem html.
